---
kind: property
id: P:Autodesk.Revit.DB.Toposolid.SketchId
source: html/e2fc2a37-4ad1-a77f-9454-a7ccd6ea6e9d.htm
---
# Autodesk.Revit.DB.Toposolid.SketchId Property

Returns id of the sketch.

## Syntax (C#)
```csharp
public ElementId SketchId { get; }
```